vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/hal/ports/NRF5/LLD/TIMERv1/hal_icu_lld.c
/*
    ChibiOS/RT - Copyright (C) 2006-2013 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/*
 * Hardware Abstraction Layer for Extended Input Capture Unit
 */
#include "hal.h"

#if (HAL_USE_ICU == TRUE) || defined(__DOXYGEN__)

/**
 * @brief   Returns the compare value of the latest cycle.
 *
 * @param[in] chp       Pointer to channel structure that fired the interrupt.
 * @return              The number of ticks.
 *
 * @notapi
 */
//#define icu_lld_get_compare(chp)     (*((chp)->ccp) + 1)

/*===========================================================================*/
/* Driver exported variables.                                                */
/*===========================================================================*/

/**
 * @brief   ICUD1 driver identifier.
 * @note    The driver ICUD1 allocates the complex timer TIMER0 when enabled.
 */
#if NRF5_ICU_USE_TIMER0 && !defined(__DOXYGEN__)
ICUDriver ICUD1;
#endif

/**
 * @brief   ICUD2 driver identifier.
 * @note    The driver ICUD2 allocates the timer TIMER1 when enabled.
 */
#if NRF5_ICU_USE_TIMER1 && !defined(__DOXYGEN__)
ICUDriver ICUD2;
#endif

/**
 * @brief   ICUD3 driver identifier.
 * @note    The driver ICUD3 allocates the timer TIMER2 when enabled.
 */
#if NRF5_ICU_USE_TIMER2 && !defined(__DOXYGEN__)
ICUDriver ICUD3;
#endif

/**
 * @brief   ICUD4 driver identifier.
 * @note    The driver ICUD4 allocates the timer TIMER3 when enabled.
 */
#if NRF5_ICU_USE_TIMER3 && !defined(__DOXYGEN__)
ICUDriver ICUD4;
#endif

/**
 * @brief   ICUD5 driver identifier.
 * @note    The driver ICUD5 allocates the timer TIMER4 when enabled.
 */
#if NRF5_ICU_USE_TIMER4 && !defined(__DOXYGEN__)
ICUDriver ICUD5;
#endif

/*===========================================================================*/
/* Driver local variables and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver local functions.                                                   */
/*===========================================================================*/
/**
 * @brief   ICU width event.
 *
 * @param[in] icup      Pointer to the @p ICUDriver object
 * @param[in] channel   The timer channel that fired the interrupt.
 *
 * @notapi
 */
static inline void _isr_invoke_width_cb(ICUDriver *icup, uint8_t channel) {
  ICUChannel *chp = &icup->channel[channel];
  if (chp->state == ICU_CH_ACTIVE) {
    icup->result.width = icup->timer->CC[channel+2] - chp->last_idle;
    if ((icup->state == ICU_ACTIVE) && (icup->config->width_cb != NULL))
      icup->config->width_cb(icup);
  }
}

/**
 * @brief   ICU period detect event.
 *
 * @param[in] icup      Pointer to the @p ICUDriver object
 * @param[in] channel   The timer channel that fired the interrupt.
 *
 * @notapi
 */
static inline void _isr_invoke_period_cb(ICUDriver *icup, uint8_t channel) {
  ICUChannel *chp = &icup->channel[channel];
  icucnt_t compare = (uint32_t) icup->timer->CC[channel];
  if (chp->state == ICU_CH_ACTIVE) {
	  icup->result.period = compare - chp->last_idle;
	  chp->last_idle = compare;
  } else {
	  chp->state = ICU_CH_ACTIVE;
  }
  if (icup->state == ICU_ACTIVE) {
	  if (icup->config->period_cb != NULL)
	      icup->config->period_cb(icup);
  } else {
	  icup->state = ICU_ACTIVE;
  }
  /* Set overflow timeout */
  icup->timer->CC[channel] = compare + ICU_WAIT_TIMEOUT;
}

/**
 * @brief   Shared IRQ handler.
 *
 * @param[in] icup     Pointer to the @p ICUDriver object
 */
void icu_lld_serve_gpiote_interrupt(ICUDriver *icup) {
  uint8_t ch;
  for (ch=0; ch<ICU_CHANNELS; ch++) {
	const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[ch];
	if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;

	/* Period event */
	if (NRF_GPIOTE->INTENSET & (1 << gpiote_channel[0]) && NRF_GPIOTE->EVENTS_IN[gpiote_channel[0]]) {
	  NRF_GPIOTE->EVENTS_IN[gpiote_channel[0]] = 0;
	  (void) NRF_GPIOTE->EVENTS_IN[gpiote_channel[0]];
	  _isr_invoke_period_cb(icup, ch);
	}
	/* Width event */
	if (NRF_GPIOTE->INTENSET & (1 << gpiote_channel[1]) && NRF_GPIOTE->EVENTS_IN[gpiote_channel[1]]) {
	  NRF_GPIOTE->EVENTS_IN[gpiote_channel[1]] = 0;
	  (void) NRF_GPIOTE->EVENTS_IN[gpiote_channel[1]];
	  _isr_invoke_width_cb(icup, ch);
	}
  }
}

/**
 * @brief   Overflow IRQ handler.
 *
 * @param[in] icup     Pointer to the @p ICUDriver object
 */
void icu_lld_serve_timer_interrupt(ICUDriver *icup) {
  uint8_t ch;
  for (ch=0; ch<ICU_CHANNELS; ch++) {
	/* Clear overflow events  */
	if (icup->timer->INTENSET & (1 << (TIMER_INTENSET_COMPARE0_Pos + ch)) &&
		icup->timer->EVENTS_COMPARE[ch]) {
	  icup->timer->EVENTS_COMPARE[ch] = 0;
	  (void) icup->timer->EVENTS_COMPARE[ch];
	  /* Set next overlow compare */
	  icup->timer->CC[ch] = icup->timer->CC[ch] + ICU_WAIT_TIMEOUT;
	 }
  }
  if (icup->config->overflow_cb != NULL)
    icup->config->overflow_cb(icup);
  icup->state = ICU_WAITING;
}

/**
 * @brief   Starts every channel.
 *
 * @param[in]   icup     Pointer to the @p ICUDriver object
 *
 * @note        GPIO Line[0] -> GPIOTE channel[0] will detect start edge.
 * @note        GPIO Line[1] -> GPIOTE channel[1] will detect end edge.
 */
static void start_channels(ICUDriver *icup) {
  /* Set each input channel that is used as: a normal input capture channel. */
#if NRF5_ICU_USE_GPIOTE_PPI
  uint8_t channel;
  for (channel = 0; channel<ICU_CHANNELS; channel++) {
	const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[channel];
	if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	const uint32_t gpio_pin0 = PAL_PAD(cfg_channel->ioline[0]);
	const uint32_t gpio_pin1 = PAL_PAD(cfg_channel->ioline[1]);

