vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/hal/ports/NRF5/LLD/TIMERv1/hal_icu_lld.c
	/* NRF52832 GPIOTE channels 0..7 */
	const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;

	// nRF52832 Rev 1 Errata 3.45 [155] GPIOTE: IN event may occur more than once on input edge
	*(volatile uint32_t *)(NRF_GPIOTE_BASE + 0x600 + (4 * 0)) = 1;
	*(volatile uint32_t *)(NRF_GPIOTE_BASE + 0x600 + (4 * 1)) = 1;

	/* Clear GPIOTE events */
	NRF_GPIOTE->INTENCLR = (GPIOTE_INTENCLR_PORT_Clear << GPIOTE_INTENCLR_PORT_Pos) |
						   (1 << gpiote_channel[0]) | (1 << gpiote_channel[1]);
	NRF_GPIOTE->EVENTS_PORT = 1;

	/* Set GPIOTE channels */
	if (cfg_channel->mode == ICU_INPUT_ACTIVE_HIGH) {
	  NRF_GPIOTE->CONFIG[gpiote_channel[0]] =
    	(GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos) |
	    ((gpio_pin0 << GPIOTE_CONFIG_PSEL_Pos) & GPIOTE_CONFIG_PSEL_Msk) |
	    ((GPIOTE_CONFIG_POLARITY_LoToHi << GPIOTE_CONFIG_POLARITY_Pos) & GPIOTE_CONFIG_POLARITY_Msk);
	  NRF_GPIOTE->CONFIG[gpiote_channel[1]] =
    	(GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos) |
	    ((gpio_pin1 << GPIOTE_CONFIG_PSEL_Pos) & GPIOTE_CONFIG_PSEL_Msk) |
	    ((GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos) & GPIOTE_CONFIG_POLARITY_Msk);
	} else {
	  NRF_GPIOTE->CONFIG[gpiote_channel[0]] =
    	(GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos) |
	    ((gpio_pin0 << GPIOTE_CONFIG_PSEL_Pos) & GPIOTE_CONFIG_PSEL_Msk) |
	    ((GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos) & GPIOTE_CONFIG_POLARITY_Msk);
	  NRF_GPIOTE->CONFIG[gpiote_channel[1]] =
    	(GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos) |
	    ((gpio_pin1 << GPIOTE_CONFIG_PSEL_Pos) & GPIOTE_CONFIG_PSEL_Msk) |
	    ((GPIOTE_CONFIG_POLARITY_LoToHi << GPIOTE_CONFIG_POLARITY_Pos) & GPIOTE_CONFIG_POLARITY_Msk);
	}

	/* NRF52832 PPI channels 0..19 */
	const uint8_t *ppi_channel    = cfg_channel->ppi_channel;

	/* Program PPI events for period */
	NRF_PPI->CH[ppi_channel[0]].EEP = (uint32_t) &NRF_GPIOTE->EVENTS_IN[gpiote_channel[0]];
	NRF_PPI->CH[ppi_channel[0]].TEP = (uint32_t) &icup->timer->TASKS_CAPTURE[channel];

	/* Program PPI events for width */
	NRF_PPI->CH[ppi_channel[1]].EEP = (uint32_t) &NRF_GPIOTE->EVENTS_IN[gpiote_channel[1]];
	NRF_PPI->CH[ppi_channel[1]].TEP = (uint32_t) &icup->timer->TASKS_CAPTURE[channel+2];
  }
#endif

}

/**
 * @brief   Stops every channel.
 *
 * @param[in]   icup     Pointer to the @p ICUDriver object
 *
 * @note        GPIO Line[0] -> GPIOTE channel[0] will detect start edge.
 * @note        GPIO Line[1] -> GPIOTE channel[1] will detect end edge.
 */
static void stop_channels(ICUDriver *icup) {
#if NRF5_ICU_USE_GPIOTE_PPI
  uint8_t channel;
  for (channel = 0; channel<ICU_CHANNELS; channel++) {
	const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[channel];
	if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;
	const uint8_t *ppi_channel = cfg_channel->ppi_channel;

	/* Disable PPI channels */
	NRF_PPI->CHENCLR = (1 << ppi_channel[0]) | (1 << ppi_channel[1]);

	/* Disable PPI events for period */
	NRF_PPI->CH[ppi_channel[0]].EEP = (uint32_t) 0;
	NRF_PPI->CH[ppi_channel[0]].TEP = (uint32_t) 0;

	/* Disable PPI events for width */
	NRF_PPI->CH[ppi_channel[1]].EEP = (uint32_t) 0;
	NRF_PPI->CH[ppi_channel[1]].TEP = (uint32_t) 0;

	/* Clear GPIOTE channels */
	NRF_GPIOTE->CONFIG[gpiote_channel[0]] = 0;
	NRF_GPIOTE->CONFIG[gpiote_channel[1]] = 0;

	const uint32_t gpio_pin0 = PAL_PAD(cfg_channel->ioline[0]);
	const uint32_t gpio_pin1 = PAL_PAD(cfg_channel->ioline[1]);

	/* Disable GPIO sense */
	NRF_P0->PIN_CNF[gpio_pin0] = ((NRF_P0->PIN_CNF[gpio_pin0] & ~(GPIO_PIN_CNF_SENSE_Msk << GPIO_PIN_CNF_SENSE_Pos)) |
									(GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos));
	NRF_P0->PIN_CNF[gpio_pin1] = ((NRF_P0->PIN_CNF[gpio_pin1] & ~(GPIO_PIN_CNF_SENSE_Msk << GPIO_PIN_CNF_SENSE_Pos)) |
									(GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos));
  }
#endif

}

/*===========================================================================*/
/* Driver interrupt handlers.                                                */
/*===========================================================================*/

#if NRF5_ICU_USE_GPIOTE_PPI
/**
 * @brief   GPIOTE events interrupt handler.
 * @note    It is assumed that the various sources are only activated if the
 *          associated callback pointer is not equal to @p NULL in order to not
 *          perform an extra check in a potentially critical interrupt handler.
 *
 * @isr     moved to nrf52_isr.c
 */
#endif /* NRF5_ICU_USE_GPIOTE_PPI */

#if NRF5_ICU_USE_TIMER0
/**
 * @brief   TIMER0 compare interrupt handler.
 * @note    It is assumed that the various sources are only activated if the
 *          associated callback pointer is not equal to @p NULL in order to not
 *          perform an extra check in a potentially critical interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(Vector60) {

  OSAL_IRQ_PROLOGUE();

  icu_lld_serve_timer_interrupt(&ICUD1);

  OSAL_IRQ_EPILOGUE();
}
#endif /* NRF5_ICU_USE_TIMER0 */

#if NRF5_ICU_USE_TIMER1
/**
 * @brief   TIMER1 interrupt handler.
 * @note    It is assumed that the various sources are only activated if the
 *          associated callback pointer is not equal to @p NULL in order to not
 *          perform an extra check in a potentially critical interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(Vector64) {

  OSAL_IRQ_PROLOGUE();

  icu_lld_serve_timer_interrupt(&ICUD2);

  OSAL_IRQ_EPILOGUE();
}
#endif /* NRF5_ICU_USE_TIMER1 */

#if NRF5_ICU_USE_TIMER2
/**
 * @brief   TIMER2 interrupt handler.
 * @note    It is assumed that the various sources are only activated if the
 *          associated callback pointer is not equal to @p NULL in order to not
 *          perform an extra check in a potentially critical interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(Vector68) {

  OSAL_IRQ_PROLOGUE();

  icu_lld_serve_timer_interrupt(&ICUD3);

  OSAL_IRQ_EPILOGUE();
}
#endif /* NRF5_ICU_USE_TIMER2 */

#if NRF5_ICU_USE_TIMER3
/**
 * @brief   TIMER3 interrupt handler.
 * @note    It is assumed that the various sources are only activated if the
 *          associated callback pointer is not equal to @p NULL in order to not
 *          perform an extra check in a potentially critical interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(VectorA8) {

  OSAL_IRQ_PROLOGUE();

  icu_lld_serve_timer_interrupt(&ICUD4);

