vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/hal/ports/NRF5/LLD/TIMERv1/hal_icu_lld.c
  OSAL_IRQ_EPILOGUE();
}
#endif /* NRF5_ICU_USE_TIMER3 */

#if NRF5_ICU_USE_TIMER4
/**
 * @brief   TIMER4 interrupt handler.
 * @note    It is assumed that the various sources are only activated if the
 *          associated callback pointer is not equal to @p NULL in order to not
 *          perform an extra check in a potentially critical interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(VectorAC) {

  OSAL_IRQ_PROLOGUE();

  icu_lld_serve_timer_interrupt(&ICUD5);

  OSAL_IRQ_EPILOGUE();
}
#endif /* NRF5_ICU_USE_TIMER4 */

/*===========================================================================*/
/* Driver exported functions.                                                */
/*===========================================================================*/

/**
 * @brief   Low level ICU driver initialization.
 *
 * @notapi
 */
void icu_lld_init(void) {
#if NRF5_ICU_USE_TIMER0
  /* Driver initialization.*/
  icuObjectInit(&ICUD1);
  ICUD1.timer = NRF_TIMER0;
#endif

#if NRF5_ICU_USE_TIMER1
  /* Driver initialization.*/
  icuObjectInit(&ICUD2);
  ICUD2.timer = NRF_TIMER1;
#endif

#if NRF5_ICU_USE_TIMER2
  /* Driver initialization.*/
  icuObjectInit(&ICUD3);
  ICUD3.timer = NRF_TIMER2;
#endif

#if NRF5_ICU_USE_TIMER3
  /* Driver initialization.*/
  icuObjectInit(&ICUD4);
  ICUD4.timer = NRF_TIMER3;
#endif

#if NRF5_ICU_USE_TIMER4
  /* Driver initialization.*/
  icuObjectInit(&ICUD5);
  ICUD5.timer = NRF_TIMER4;
#endif
}

/**
 * @brief   Configures and activates the ICU peripheral.
 *
 * @param[in] icup     Pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_start(ICUDriver *icup) {
  osalDbgAssert((&icup->config->iccfgp[0] != NULL) ||
                (&icup->config->iccfgp[1] != NULL),
                 "invalid input configuration");
  /* Prescaler value calculation: ftimer = 16MHz / 2^PRESCALER */
  uint16_t psc_ratio = 16000000 / icup->config->frequency;
  /* Prescaler ratio must be between 1 and 512, and a power of two. */
  osalDbgAssert(psc_ratio <= 512 && !(psc_ratio & (psc_ratio - 1)),
                "invalid frequency");
  /* Prescaler value as a power of 2, must be 0..9 */
  uint32_t psc_value;
  for (psc_value = 0; psc_value < 10; psc_value++)
    if (psc_ratio == (unsigned)(1 << psc_value))
      break;

  /* Configure as 32bits timer */
  icup->timer->BITMODE = TIMER_BITMODE_BITMODE_32Bit;

  /* Set timer mode */
  icup->timer->MODE = TIMER_MODE_MODE_Timer;

  /* Set prescaler */
  icup->timer->PRESCALER = psc_value;

  /* With clear shortcuts. */
  icup->timer->SHORTS = 0;

  /* Clear Timer */
  icup->timer->TASKS_CLEAR = 1;

  /* Disable and reset interrupts for compare events */
  icup->timer->INTENCLR = (TIMER_INTENCLR_COMPARE0_Msk |
                           TIMER_INTENCLR_COMPARE1_Msk |
                           TIMER_INTENCLR_COMPARE2_Msk |
                           TIMER_INTENCLR_COMPARE3_Msk );

  icup->timer->EVENTS_COMPARE[0] = 0;
  icup->timer->EVENTS_COMPARE[1] = 0;
  icup->timer->EVENTS_COMPARE[2] = 0;
  icup->timer->EVENTS_COMPARE[3] = 0;
  (void) icup->timer->EVENTS_COMPARE[0];
  (void) icup->timer->EVENTS_COMPARE[1];
  (void) icup->timer->EVENTS_COMPARE[2];
  (void) icup->timer->EVENTS_COMPARE[3];

/* Enable GPIOTE and TIMER interrupt vectors.*/
#if NRF5_ICU_USE_GPIOTE_PPI
  uint8_t channel;
  for (channel = 0; channel<ICU_CHANNELS; channel++) {
	const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[channel];
	if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	const uint32_t gpio_pin0 = PAL_PAD(cfg_channel->ioline[0]);
	const uint32_t gpio_pin1 = PAL_PAD(cfg_channel->ioline[1]);
	osalDbgAssert((gpio_pin0 < 32) &&
	              (gpio_pin1 < 32) &&
				  (gpio_pin0 != gpio_pin1),
	               "invalid Line configuration");

	/* NRF52832 GPIOTE channels 0..7 */
	const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;
	osalDbgAssert((gpiote_channel[0] < 8) &&
	              (gpiote_channel[1] < 8) &&
				  (gpiote_channel[0] != gpiote_channel[1]),
	               "invalid GPIOTE configuration");

	/* NRF52832 PPI channels 0..19 */
	osalDbgAssert((gpiote_channel[0] < 20) &&
	              (gpiote_channel[1] < 20) &&
				  (gpiote_channel[0] != gpiote_channel[1]),
	               "invalid PPI configuration");
  }

  /* Set GPIOTE & PPI channels */
  start_channels(icup);

  nvicEnableVector(GPIOTE_IRQn, NRF5_ICU_GPIOTE_IRQ_PRIORITY);
#endif
#if NRF5_ICU_USE_TIMER0
    if (&ICUD1 == icup) {
      nvicEnableVector(TIMER0_IRQn, NRF5_ICU_TIMER0_IRQ_PRIORITY);
    }
#endif
#if NRF5_ICU_USE_TIMER1
    if (&ICUD2 == icup) {
      nvicEnableVector(TIMER1_IRQn, NRF5_ICU_TIMER1_IRQ_PRIORITY);
    }
#endif
#if NRF5_ICU_USE_TIMER2
    if (&ICUD3 == icup) {
      nvicEnableVector(TIMER2_IRQn, NRF5_ICU_TIMER2_IRQ_PRIORITY);
    }
#endif
#if NRF5_ICU_USE_TIMER3
    if (&ICUD4 == icup) {
      nvicEnableVector(TIMER3_IRQn, NRF5_ICU_TIMER3_IRQ_PRIORITY);
    }
#endif
#if NRF5_ICU_USE_TIMER4
    if (&ICUD5 == icup) {
      nvicEnableVector(TIMER4_IRQn, NRF5_ICU_TIMER4_IRQ_PRIORITY);
    }
#endif

}

/**
 * @brief   Deactivates the ICU peripheral.
 *
 * @param[in] icup     Pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_stop(ICUDriver *icup) {

  if (icup->state == ICU_READY) {
    /* Timer stop.*/
	icup->timer->TASKS_STOP = 1;
	icup->timer->TASKS_SHUTDOWN = 1;

#if NRF5_ICU_USE_GPIOTE_PPI
	uint8_t channel;
	for (channel = 0; channel<ICU_CHANNELS; channel++) {
	  const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[channel];

	  if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	  /* Disable Timer interrupt */
	  icup->timer->INTENCLR = 1 << (TIMER_INTENCLR_COMPARE0_Pos + channel);

	  /* Disable GPIOTE interrupt */
	  const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;
	  NRF_GPIOTE->INTENCLR = (GPIOTE_INTENCLR_PORT_Clear << GPIOTE_INTENCLR_PORT_Pos) |
			  	  	  	  	 (1 << gpiote_channel[0]) | (1 << gpiote_channel[1]);
	  NRF_GPIOTE->EVENTS_PORT = 0;
	  (void) NRF_GPIOTE->EVENTS_PORT;

	  NRF_GPIOTE->EVENTS_IN[gpiote_channel[0]] = 0;
	  NRF_GPIOTE->EVENTS_IN[gpiote_channel[1]] = 0;
	  (void) NRF_GPIOTE->EVENTS_IN[gpiote_channel[0]];
	  (void) NRF_GPIOTE->EVENTS_IN[gpiote_channel[1]];
	}

	nvicDisableVector(GPIOTE_IRQn);

	/* Stop GPIOTE & PPI channels */
	stop_channels(icup);
#endif
#if NRF5_ICU_USE_TIMER0
    if (&ICUD1 == icup) {
      nvicDisableVector(TIMER0_IRQn);
    }
#endif
#if NRF5_ICU_USE_TIMER1
    if (&ICUD2 == icup) {
      nvicDisableVector(TIMER1_IRQn);
    }
#endif
#if NRF5_ICU_USE_TIMER2
    if (&ICUD3 == icup) {
      nvicDisableVector(TIMER2_IRQn);
    }
#endif
#if NRF5_ICU_USE_TIMER3
    if (&ICUD4 == icup) {
      nvicDisableVector(TIMER3_IRQn);
    }
#endif
#if NRF5_ICU_USE_TIMER4
    if (&ICUD5 == icup) {
      nvicDisableVector(TIMER4_IRQn);
    }
#endif
  }
}

/**
 * @brief   Starts the input capture.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_start_capture(ICUDriver *icup) {
  uint8_t channel;

  /* Clear and start Timer */
  icup->timer->TASKS_CLEAR = 1;
  icup->timer->TASKS_START = 1;

#if NRF5_ICU_USE_GPIOTE_PPI
  for (channel = 0; channel<ICU_CHANNELS; channel++) {
	const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[channel];

