vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/hal/ports/NRF5/LLD/TIMERv1/hal_icu_lld.c
	if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;
	const uint8_t *ppi_channel    = cfg_channel->ppi_channel;

	/* clean channel structures and set pointers to channel configs */
	icup->channel[channel].last_active = 0;
	icup->channel[channel].last_idle = 0;
	icup->channel[channel].state = ICU_CH_IDLE;

	/* Enable interrupt for overflow events */
	icup->timer->CC[channel] = ICU_WAIT_TIMEOUT;
	icup->timer->INTENSET = 1 << (TIMER_INTENSET_COMPARE0_Pos + channel);

	/* Disable GPIOTE interrupts */
	NRF_GPIOTE->INTENCLR = (GPIOTE_INTENCLR_PORT_Clear << GPIOTE_INTENCLR_PORT_Pos) |
							(1 << gpiote_channel[0]) | (1 << gpiote_channel[1]);
	NRF_GPIOTE->EVENTS_PORT = 1;

	/* Clear GPIOTE events */
	NRF_GPIOTE->EVENTS_IN[gpiote_channel[0]] = 0;
	NRF_GPIOTE->EVENTS_IN[gpiote_channel[1]] = 0;
	(void) NRF_GPIOTE->EVENTS_IN[gpiote_channel[0]];
	(void) NRF_GPIOTE->EVENTS_IN[gpiote_channel[1]];

	/* Set GPIOTE channels */
	NRF_GPIOTE->CONFIG[gpiote_channel[0]] = (NRF_GPIOTE->CONFIG[gpiote_channel[0]] & ~GPIOTE_CONFIG_MODE_Msk) |
										  	(GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos);
	NRF_GPIOTE->CONFIG[gpiote_channel[1]] = (NRF_GPIOTE->CONFIG[gpiote_channel[1]] & ~GPIOTE_CONFIG_MODE_Msk) |
			  	  	  	  	  	  	  	  	(GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos);

	/* Enable PPI channels */
	NRF_PPI->CHENSET = (1 << ppi_channel[0]) | (1 << ppi_channel[1]);
  }
#endif
}

/**
 * @brief   Waits for a completed capture.
 * @note    The operation is performed in polled mode.
 * @note    In order to use this function notifications must be disabled.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 * @return              The capture status.
 * @retval false        if the capture is successful.
 * @retval true         if a timer overflow occurred.
 *
 * @notapi
 */
bool icu_lld_wait_capture(ICUDriver *icup) {

  /* If the driver is still in the ICU_WAITING state then we need to wait
     for the first activation edge.*/
  if (icup->state == ICU_WAITING)
    if (icu_lld_wait_edge(icup))
      return true;

  /* This edge marks the availability of a capture result.*/
  return icu_lld_wait_edge(icup);
}

/**
 * @brief   Stops the input capture.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_stop_capture(ICUDriver *icup) {
  /* Timer stopped.*/
  icup->timer->TASKS_STOP = 1;

#if NRF5_ICU_USE_GPIOTE_PPI
	uint8_t channel;
	for (channel = 0; channel<ICU_CHANNELS; channel++) {
	  const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[channel];

	  if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	  const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;
	  const uint8_t *ppi_channel = cfg_channel->ppi_channel;

	  /* Disable Timer interrupt for overflow events */
	  icup->timer->INTENCLR = 1 << (TIMER_INTENCLR_COMPARE0_Pos + channel);

	  /* Disable PPI channels */
	  NRF_PPI->CHENCLR = (1 << ppi_channel[0]) | (1 << ppi_channel[1]);

	  /* Disable GPIOTE interrupts */
	  NRF_GPIOTE->INTENCLR = (GPIOTE_INTENCLR_PORT_Clear << GPIOTE_INTENCLR_PORT_Pos) |
								(1 << gpiote_channel[0]) | (1 << gpiote_channel[1]);
	  NRF_GPIOTE->EVENTS_PORT = 1;

	  /* Disable GPIOTE channels */
	  NRF_GPIOTE->CONFIG[gpiote_channel[0]] = (NRF_GPIOTE->CONFIG[gpiote_channel[0]] & ~GPIOTE_CONFIG_MODE_Msk) |
			  	  	  	  	  	  	  	  	  (GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos);
	  NRF_GPIOTE->CONFIG[gpiote_channel[1]] = (NRF_GPIOTE->CONFIG[gpiote_channel[1]] & ~GPIOTE_CONFIG_MODE_Msk) |
			  	  	  	  	  	  	  	  	  (GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos);
	}
#endif
}

/**
 * @brief   Enables notifications.
 * @pre     The ICU unit must have been activated using @p icuStart() and the
 *          capture started using @p icuStartCapture().
 * @note    If the notification is already enabled then the call has no effect.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_enable_notifications(ICUDriver *icup) {
#if NRF5_ICU_USE_GPIOTE_PPI
	uint8_t channel;
	for (channel = 0; channel<ICU_CHANNELS; channel++) {
	  const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[channel];

	  if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	  /* Enable Timer interrupt */
	  icup->timer->INTENSET = 1 << (TIMER_INTENSET_COMPARE0_Pos + channel);

	  /* Enable GPIOTE interrupt */
	  const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;
	  NRF_GPIOTE->INTENSET = (GPIOTE_INTENSET_PORT_Set << GPIOTE_INTENSET_PORT_Pos) |
			  	  	  	  	 (1 << gpiote_channel[0]) | (1 << gpiote_channel[1]);
	}
#endif
}

/**
 * @brief   Disables notifications.
 * @pre     The ICU unit must have been activated using @p icuStart() and the
 *          capture started using @p icuStartCapture().
 * @note    If the notification is already disabled then the call has no effect.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
void icu_lld_disable_notifications(ICUDriver *icup) {
  /* All interrupts disabled.*/
#if NRF5_ICU_USE_GPIOTE_PPI
	uint8_t channel;
	for (channel = 0; channel<ICU_CHANNELS; channel++) {
	  const ICUChannelConfig *cfg_channel = &icup->config->iccfgp[channel];

	  if (cfg_channel == NULL || cfg_channel->mode == ICU_INPUT_DISABLED) continue;

	  const uint8_t *gpiote_channel = cfg_channel->gpiote_channel;

	  /* Disable Timer interrupt for overflow events */
	  icup->timer->INTENCLR = 1 << (TIMER_INTENCLR_COMPARE0_Pos + channel);

	  /* Disable GPIOTE interrupt */
	  NRF_GPIOTE->INTENCLR = (GPIOTE_INTENCLR_PORT_Clear << GPIOTE_INTENCLR_PORT_Pos) |
			  	  	  	  	 (1 << gpiote_channel[0]) | (1 << gpiote_channel[1]);
	  NRF_GPIOTE->EVENTS_PORT = 1;
	}
#endif

}

#endif /* HAL_USE_ICU */
